# CanExecuteEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CanExecuteEventArgs Properties
CanExecuteEventArgs Class See Also
---
The CanExecuteEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveDocument | The active document.  (Inherited from CommandEventArgs.) |
| Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.  (Inherited from RevitEventArgs.) |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitEventArgs.) |
| CanExecute | The value that indicates whether the Command associated with this event can be executed. |
| CommandId | The command id.  (Inherited from CommandEventArgs.) |
| IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state. |

# See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace